
&НаСервере
Функция РасчетИтогов(Начало, Конец)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегистрБухгалтерииОстаткиИОбороты.СуммаОборот, 0) КАК СуммаОборотов
	|ИЗ
	|	РегистрБухгалтерии.РегистрБухгалтерии.ОстаткиИОбороты(&Начало, &Конец,,, Счет = &Счет,) КАК РегистрБухгалтерииОстаткиИОбороты";
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.БухУчет.Себестоимость);
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Себестоимость = Выборка.СуммаОборотов;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегистрБухгалтерииОстаткиИОбороты.СуммаОборот, 0) КАК СуммаОборотов
	|ИЗ
	|	РегистрБухгалтерии.РегистрБухгалтерии.ОстаткиИОбороты(&Начало, &Конец,,, Счет = &Счет,) КАК
	|		РегистрБухгалтерииОстаткиИОбороты";
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.БухУчет.Выручка);
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Выручка = Выборка.СуммаОборотов;
	
	Прибыль = -(Выручка + Себестоимость);
	Возврат Прибыль;
	
КонецФункции


&НаКлиенте
Процедура РасчетИтоговЗаМесяц(Команда)
	Начало = НачалоМесяца(Объект.Дата);
	Конец = КонецМесяца(Объект.Дата);
	
	Объект.Прибыль = РасчетИтогов(Начало, Конец);
КонецПроцедуры

