Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Движения.РегистрБухгалтерии.Записывать = Истина;
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Товар, Характеристика", "Количество,  Сумма");
	
	Для Каждого ТекСтрокаТовары из ТЗ Цикл
		
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.ХарактеристикаТовара = ТекСтрокаТовары.Характеристика;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	
	
		Движение = Движения.СебестоимостьТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.ХарактеристикаТовара = ТекСтрокаТовары.Характеристика;
		Движение.Партия = Ссылка;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Сумма;
		
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.Период = Дата;
		Проводка.Сумма = ТекСтрокаТовары.Сумма;
		Проводка.СчетДт = ПланыСчетов.БухУчет.Поставщики;
		Проводка.СчетКт = ПланыСчетов.БухУчет.Касса;
		
		
	КонецЦикла;
	Движения.Записать();
	


КонецПроцедуры