
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.Сумма / Элементы.Товары.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Функция Печать(Команда)
	ТабДок = ПечатьНаСервере();
	ТабДок.Показать();
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");
	
	ОблШапка.Параметры.НомерДокумента = Объект.Номер;
	ОблШапка.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДЛФ=ДД" );
	ТабДок.Вывести(ОблШапка);
	
	Для Каждого Стр Из Объект.Товары Цикл
		ОблСтрока.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;	
	
	ОблПодвал.Параметры.Заполнить(Объект);
	ОблПодвал.Параметры.Валюта = Объект.ВалютаДокумента;
	ОблПодвал.Параметры.Сумма = Объект.Товары.Итог("Сумма");
	ТабДок.Вывести(ОблПодвал);
	
	Возврат ТабДок;

КонецФункции







&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
 
	
	Товар = Элементы.Товары.ТекущиеДанные;
	Элементы.Товары.ТекущиеДанные.Сумма = РассчитатьСумму(Товар);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные;
	Элементы.Товары.ТекущиеДанные.Сумма = РассчитатьСумму(Товар);
	
КонецПроцедуры



&НаКлиенте
Функция РассчитатьСумму(Товар)
	Товар.Сумма = Товар.Цена * Товар.Количество;
	Возврат Товар.Сумма;
КонецФункции



&НаКлиенте
Процедура ВалютаДокументаПриИзменении1(Элемент)
	КурсКРублю = ВозвратКурсаВалюты(Объект.Дата, Объект.ВалютаДокумента);
КонецПроцедуры




&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КурсКРублю = ВозвратКурсаВалюты(Объект.Дата, Объект.ВалютаДокумента);
КонецПроцедуры



&НаСервере
Функция ВозвратКурсаВалюты(АктуальнаяДата, ЭлементНоменклатуры) 
	
	Отбор = Новый Структура ("Валюты", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначениеРесурсов.КурсВалюты;
	
КонецФункции