

&НаКлиенте
Процедура ВыбранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
		Для Каждого Элем Из ПараметрыПеретаскивания.Значение  Цикл
	
			ПолучениеДанных(Элем);
		КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	АдресВХ = ЗавершитьПодборНаСервере();
	ВладелецФормы.ОбработатьПодбор(АдресВХ);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗавершитьПодборНаСервере()
	Возврат ПоместитьВоВременноеХранилище(ВыбранныеТовары.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ВыбранныеТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы(Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы(Элементы);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммы(Элементы)
	Элементы.ВыбранныеТовары.ТекущиеДанные.Сумма = Элементы.ВыбранныеТовары.ТекущиеДанные.Количество * Элементы.ВыбранныеТовары.ТекущиеДанные.Цена;
КонецПроцедуры





&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.СкладПараметр);
	Склад = Параметры.СкладПараметр;
	ВыбранныеТовары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХ));
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
КонецПроцедуры


&НаСервере
Процедура ПолучениеДанных(ВыбраннаяСтрока)
	Перемен = ВыбраннаяСтрока.ПолучитьОбъект();
	Стр = ВыбранныеТовары.Добавить();
	Стр.Товар = Перемен.Владелец.ССылка;
	Стр.Характеристика = Перемен.Ссылка;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПолучениеДанных(ВыбраннаяСтрока);

КонецПроцедуры



